; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v9 ?v2)
             (pred_12 ?v6 ?v13)
             (pred_6 ?v9 ?v13)
             (pred_9 ?v8 ?v9 )
	     (pred_11 ?v9)
             (pred_8 ?v7)
             (pred_5 ?v6)
             (pred_10 ?v13)
             (pred_2 ?v9)
             (pred_7 ?v6)
             (pred_4 ?v9)
             (pred_3 ))



(:action op_4
:parameters (?v5 ?v11 ?v10 ?v3)
:precondition (and (pred_8 ?v5) (pred_8 ?v11) (pred_5 ?v10) (pred_10 ?v3)
          (pred_1 ?v5 ?v11) (pred_12 ?v10 ?v3)
                   (pred_6 ?v11 ?v3) (pred_11 ?v5) 
                   (pred_2 ?v11) (pred_7 ?v10))
:effect (and  (pred_4 ?v11) (not (pred_2 ?v11))))


(:action op_5
:parameters (?v5 ?v1)
:precondition (and (pred_8 ?v5) (pred_8 ?v1)
               (pred_11 ?v5) (pred_1 ?v5 ?v1) (pred_4 ?v1))
:effect (and (pred_11 ?v1) (not (pred_11 ?v5))))

(:action op_2
:parameters (?v5 ?v10)
:precondition (and (pred_8 ?v5) (pred_5 ?v10) 
                  (pred_11 ?v5) (pred_9 ?v10 ?v5) (pred_3 ))
:effect (and (pred_7 ?v10)
   (not (pred_9 ?v10 ?v5)) (not (pred_3 ))))


(:action op_3
:parameters (?v5 ?v12 ?v4)
:precondition (and (pred_8 ?v5) (pred_5 ?v12) (pred_5 ?v4)
                  (pred_11 ?v5) (pred_7 ?v4) (pred_9 ?v12 ?v5))
:effect (and (pred_7 ?v12) (pred_9 ?v4 ?v5)
        (not (pred_7 ?v4)) (not (pred_9 ?v12 ?v5))))

(:action op_1
:parameters (?v5 ?v10)
:precondition (and (pred_8 ?v5) (pred_5 ?v10) 
                  (pred_11 ?v5) (pred_7 ?v10))
:effect (and (pred_3 ) (pred_9 ?v10 ?v5) (not (pred_7 ?v10)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_20 obj_14 obj_18 obj_03 obj_15 obj_12 obj_10 obj_08 obj_01 obj_05 obj_21 obj_22 obj_13 obj_06 obj_11 obj_17
    obj_16 obj_07 obj_09
    obj_19 obj_02 obj_04
    )

    (:init
       (pred_3)

       (pred_8 obj_20)
       (pred_8 obj_14)
       (pred_8 obj_18)
       (pred_8 obj_03)
       (pred_8 obj_15)
       (pred_8 obj_12)
       (pred_8 obj_10)
       (pred_8 obj_08)
       (pred_8 obj_01)
       (pred_8 obj_05)
       (pred_8 obj_21)
       (pred_8 obj_22)
       (pred_8 obj_13)
       (pred_8 obj_06)
       (pred_8 obj_11)
       (pred_8 obj_17)
       (pred_10 obj_16)
       (pred_10 obj_07)
       (pred_10 obj_09)
       (pred_5 obj_19)
       (pred_5 obj_02)
       (pred_5 obj_04)

       (pred_1 obj_20 obj_15)
       (pred_1 obj_20 obj_14)
       (pred_1 obj_14 obj_12)
       (pred_1 obj_14 obj_18)
       (pred_1 obj_14 obj_20)
       (pred_1 obj_18 obj_10)
       (pred_1 obj_18 obj_03)
       (pred_1 obj_18 obj_14)
       (pred_1 obj_03 obj_08)
       (pred_1 obj_03 obj_18)
       (pred_1 obj_15 obj_01)
       (pred_1 obj_15 obj_12)
       (pred_1 obj_15 obj_20)
       (pred_1 obj_12 obj_05)
       (pred_1 obj_12 obj_10)
       (pred_1 obj_12 obj_14)
       (pred_1 obj_12 obj_15)
       (pred_1 obj_10 obj_21)
       (pred_1 obj_10 obj_08)
       (pred_1 obj_10 obj_18)
       (pred_1 obj_10 obj_12)
       (pred_1 obj_08 obj_22)
       (pred_1 obj_08 obj_03)
       (pred_1 obj_08 obj_10)
       (pred_1 obj_01 obj_13)
       (pred_1 obj_01 obj_05)
       (pred_1 obj_01 obj_15)
       (pred_1 obj_05 obj_06)
       (pred_1 obj_05 obj_21)
       (pred_1 obj_05 obj_12)
       (pred_1 obj_05 obj_01)
       (pred_1 obj_21 obj_11)
       (pred_1 obj_21 obj_22)
       (pred_1 obj_21 obj_10)
       (pred_1 obj_21 obj_05)
       (pred_1 obj_22 obj_17)
       (pred_1 obj_22 obj_08)
       (pred_1 obj_22 obj_21)
       (pred_1 obj_13 obj_06)
       (pred_1 obj_13 obj_01)
       (pred_1 obj_06 obj_11)
       (pred_1 obj_06 obj_05)
       (pred_1 obj_06 obj_13)
       (pred_1 obj_11 obj_17)
       (pred_1 obj_11 obj_21)
       (pred_1 obj_11 obj_06)
       (pred_1 obj_17 obj_22)
       (pred_1 obj_17 obj_11)
       (pred_2 obj_14)
       (pred_2 obj_21)
       (pred_2 obj_08)
       (pred_6  obj_14 obj_16)
       (pred_6  obj_21 obj_07)
       (pred_6  obj_08 obj_09)
       (pred_4 obj_20)
       (pred_4 obj_18)
       (pred_4 obj_03)
       (pred_4 obj_15)
       (pred_4 obj_12)
       (pred_4 obj_10)
       (pred_4 obj_01)
       (pred_4 obj_05)
       (pred_4 obj_22)
       (pred_4 obj_13)
       (pred_4 obj_06)
       (pred_4 obj_11)
       (pred_4 obj_17)

       (pred_12  obj_19 obj_16)
       (pred_12  obj_02 obj_07)
       (pred_12  obj_04 obj_09)
       (pred_9 obj_19 obj_03)
       (pred_9 obj_02 obj_01)
       (pred_9 obj_04 obj_03)
       (pred_11 obj_03)
    )

    (:goal (and
       (pred_9 obj_04 obj_06)
    ))
(:constraints
  (always (not (pred_11 obj_05)))
)
)

; plan
1. (op_2 obj_03 obj_04)
   deleted: (pred_9 obj_04 obj_03) (pred_3)
   added: (pred_7 obj_04)
   goals met: 0 of 1
2. (op_5 obj_03 obj_18)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_18)
   goals met: 0 of 1
3. (op_5 obj_18 obj_10)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_10)
   goals met: 0 of 1
4. (op_5 obj_10 obj_12)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_12)
   goals met: 0 of 1
5. (op_5 obj_12 obj_15)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_15)
   goals met: 0 of 1
6. (op_5 obj_15 obj_01)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_01)
   goals met: 0 of 1
7. (op_5 obj_01 obj_13)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_13)
   goals met: 0 of 1
8. (op_5 obj_13 obj_06)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_06)
   goals met: 0 of 1
9. (op_1 obj_06 obj_04)
   deleted: (pred_7 obj_04)
   added: (pred_3) (pred_9 obj_04 obj_06)
   goals met: 1 of 1
